Revit 2025 API
RebarBendData.HookLength0 Property
 The extension length of the hook at the start.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
public double HookLength0 { get; set; }
Public Property HookLength0 As Double
	Get
	Set
public:
property double HookLength0 {
	double get ();
	void set (double value);
}
member HookLength0 : float with get, set
Property Value
Double
See Also
Reference
RebarBendData Class
Autodesk.Revit.DB.Structure Namespace